package szz.com.thirdworld;


import org.junit.Test;

import java.util.ArrayList;
import java.util.Arrays;

import szz.com.baselib.entity.UserInfo;

/**
 * Example local unit test, which will execute on the development machine (host).
 *
 * @see <a href="http://d.android.com/tools/testing">Testing documentation</a>
 */
public class ExampleUnitTest {

    @Test
    public void addition_isCorrect() throws Exception {
        ArrayList<String> strs = new ArrayList<>();
        strs.add("c3:cb:be:fc:d4:d3:bb:f5:c6:cc:d6:d8:d6:c3:a1:fe:68:79:38:31:34:09:31:38:33:2e:36:30:2e:32:30:34:2e:36:34:09:31:38:33:2e:36:30:2e:32:30:34:2e:36:34");
        strs.add("b4:ed:ce:f3:a3:ac:b8:f3:cf:c2:bd:f1:c8:d5:d6:d8:d6:c3:b4:ce:ca:fd:d2:d1:be:ad:20:5b:37:5d:b4:ce:c0:b2:a3:a1");
        strs.add("c3:cb:be:fc:ba:da:b5:ea:cb:e6:bb:fa:d4:d3:bb:f5:c6:cc:b6:c1:c8:a1:a1:fe:68:79:38:31:34:a1:fe:09:31:38:33:2e:36:30:2e:32:30:34:2e:36:34:09:31:38:33:2e:36:30:2e:32:30:34:2e:36:34");
        strs.add("c3:cb:be:fc:ba:da:b5:ea:cb:e6:bb:fa:d4:d3:bb:f5:c6:cc:b6:c1:c8:a1:b3:c9:b9:a6:a1:fe:a1:f9:d4:f6:bc:d3:bb:ee:c1:a6:20:35:30:20:31:30:30:20:35:30:30:30:20:31:30:a3:ac:ca:de:bb:ea:5f:d0:fe:ce:e4:20:32:30:20:31:30:30:30:20:31:30:30:30:30:30:20:36:30:a3:ac:cb:e9:c6:ac:5f:d0:c7:bb:ea:5f:be:de:d0:b7:20:31:30:20:31:30:30:20:35:30:30:30:20:31:30:a3:ac:c7:b1:c4:dc:5f:c9:f1:d0:d0:2b:35:20:35:20:35:30:30:20:32:35:30:30:30:20:35:30:a3:ac:c7:b1:c4:dc:5f:d1:aa:c5:a3:2b:34:20:35:20:33:30:30:20:31:35:30:30:30:20:33:30:a3:ac:cb:e9:c6:ac:5f:d0:c7:bb:ea:5f:c9:e4:ca:d6:20:33:20:31:30:30:20:35:30:30:30:20:31:30:a3:ac:a1:f9:d4:f6:bc:d3:bb:ee:c1:a6:20:35:30:20:31:30:30:20:35:30:30:30:20:31:30:a3:ac:cb:e9:c6:ac:5f:d0:c7:bb:ea:5f:cb:ab:d7:d3:20:31:30:20:31:30:30:20:35:30:30:30:20:31:30:a3:ac:cb:e9:c6:ac:5f:d0:c7:bb:ea:5f:cc:ec:d0:ab:20:35:20:31:30:30:20:35:30:30:30:20:31:30:a3:ac:ca:de:bb:ea:5f:97:83:e8:bb:20:32:30:20:35:30:30:20:35:30:30:30:30:20:34:30:a3:ac:cb:e9:c6:ac:5f:d0:c7:bb:ea:5f:cb:ae:c6:bf:20:33:20:31:30:30:20:35:30:30:30:20:31:30:a3:ac:ca:de:bb:ea:5f:c7:e0:c1:fa:20:32:30:20:31:30:30:30:20:31:30:30:30:30:30:20:36:30:a3:ac:b1:a6:cf:e4:5f:2b:32:20:33:20:35:30:20:32:35:30:30:20:35:a3:ac:ca:de:bb:ea:5f:bb:ec:e3:e7:20:32:30:20:35:30:30:20:35:30:30:30:30:20:34:30:a3:ac:ca:de:bb:ea:5f:b0:d7:bb:a2:20:32:30:20:31:30:30:30:20:31:30:30:30:30:30:20:36:30:a1:fe:31:30:31:30:30:30:31:31:30:30:30:30:30:30:31:a1:fe:37");
        strs.add("c3:cb:be:fc:ba:da:b5:ea:cb:e6:bb:fa:d4:d3:bb:f5:c6:cc:bf:aa:ca:bc:b9:ba:c2:f2:a1:fe:68:79:38:31:34:a1:fe:31:32:33:a1:fe:39:09:31:38:33:2e:36:30:2e:32:30:34:2e:36:34:09:31:38:33:2e:36:30:2e:32:30:34:2e:36:34");
        strs.add("c3:cb:be:fc:ba:da:b5:ea:cb:e6:bb:fa:d4:d3:bb:f5:c6:cc:d2:d1:be:ad:b9:ba:c2:f2:cd:ea:b3:c9:a1:fe:31:30:31:30:30:30:31:31:31:30:30:30:30:30:31:a1:fe:31:32:31:39:a1:fe:33:34:31:38:a1:fe:33:36:30:35:a1:fe:33:31:38:34:a1:fe:38:38:30:39:a1:fe:31:36:35:a1:fe:34:a1:fe:30:a1:fe:32:38:a1:fe:33:38:31:35:a1:fe:34:34:32:a1:fe:32:32:30:31:a1:fe:34:34:34:37:2e:39:38:39:a1:fe:32:32:37:34:33:35:a1:fe:cb:e9:c6:ac:5f:d0:c7:bb:ea:5f:cc:ec:d0:ab");
        strs.add("0");
        strs.add("0");
        strs.add("0");
        strs.add("0");
        strs.add("0");
        strs.add("0");
        strs.add("0");
        strs.add("0");
        strs.add("0");
        strs.add("0");
        byte[] bts;
        String s;
        for (String str : strs) {
            bts = hexStringToBytes(str);
            s = new String(bts, "gbk");
            logLn(s);
        }
    }

    @Test
    public void t2() {
        String s = "帮派个人资料返回〓hy814〓3※有时很忙〓无〓无〓52491 0 91535 20800 20800〓白发妖姬 土 64000 0 136295 0〓正常〓0.0000〓177966 177966 177966 177966 182966〓18510〓2949654〓0〓140〓5709〓3〓2319〓5418〓568〓5234〓5972〓121〓72〓12〓30〓4296162〓0〓0〓1905.0968〓4160 4472 4192 4284 4080 4456 4180 4276〓6000〓0〓1999〓124〓9588 10345 10196 9947 9588 10345 10196 9947〓2017-05-20〓2288869〓16〓27〓999〓0〓999〓1 1 1〓1442〓3136 3156 3137 3117 3007 3004 2992 3038〓2871〓1〓5〓0 0 0 0 0 0 0 0〓60 60 60 60 60 60 60 60〓155484〓0〓无〓无〓无〓0〓112〓4785 4650 4384 1362 4785 4650 4384 1362〓0 0 0 0 0 0 0 0〓120 60 240 180 120 60 240 180〓未知属性9〓未知属性10〓4〓93198〓80〓114962〓42645〓42645〓110〓2521 120 311";
        String[] strings = s.split("〓");
        String s2 = "帮派个人资料返回〓hy815〓有时候很忙〓打杂杂〓普通成员〓1 0 1000 4838 1150〓※★第1届赛宠 水 64000 45150 43093 0〓正常〓0.0000〓137329 137624 137342 137363 137377〓23905〓811382〓0〓112〓295919〓0〓1418〓1677〓3513〓1692〓275〓0〓0〓0〓0〓487423〓5〓5〓1513.1039〓1395 1275 1350 1275 1365 1350 1395 1320〓0〓999〓18773〓100〓917 932 1014 918 917 932 1014 918〓2017-05-23〓76016〓5〓0〓0〓10〓999〓1 1 0〓588〓253 261 267 265 260 265 257 259〓284〓0〓0〓0 0 0 0 0 0 0 0〓0 0 0 0 0 0 0 0〓0〓1〓无〓无〓无〓0〓92〓3004 2794 593 443 3004 2794 593 443〓0 0 0 0 0 0 0 0〓0 0 0 0 0 0 0 0〓未知属性9〓未知属性10〓41〓2015021〓0〓38050〓0〓0〓90〓140 31 50";
        String[] strings2 = s2.split("〓");
        int i = 0;
        for (String string : strings) {
            log(string + "\t");
            logLn(strings2[i++]);
        }

    }

    @Test
    public void t4() {
        boolean str = true ^ false;
        System.out.println(str);
        str = true ^ true;
        System.out.println(str);
        str = false ^ false;
        System.out.println(str);
        str = false ^ true;
        System.out.println(str);
    }

    @Test
    public void t3() {
        String s = "帮派个人资料返回〓hy814〓3※有时很忙〓无〓无〓52491 0 91535 20800 20800〓白发妖姬 土 64000 0 136295 0〓正常〓0.0000〓177966 177966 177966 177966 182966〓18510〓2949654〓0〓140〓5709〓3〓2319〓5418〓568〓5234〓5972〓121〓72〓12〓30〓4296162〓0〓0〓1905.0968〓4160 4472 4192 4284 4080 4456 4180 4276〓6000〓0〓1999〓124〓9588 10345 10196 9947 9588 10345 10196 9947〓2017-05-20〓2288869〓16〓27〓999〓0〓999〓1 1 1〓1442〓3136 3156 3137 3117 3007 3004 2992 3038〓2871〓1〓5〓0 0 0 0 0 0 0 0〓60 60 60 60 60 60 60 60〓155484〓0〓无〓无〓无〓0〓112〓4785 4650 4384 1362 4785 4650 4384 1362〓0 0 0 0 0 0 0 0〓120 60 240 180 120 60 240 180〓未知属性9〓未知属性10〓4〓93198〓80〓114962〓42645〓42645〓110〓2521 120 311";
        UserInfo userInfo = UserInfo.parse(s);
        logLn(userInfo.toString());
        String s2 = "帮派个人资料返回〓hy815〓有时候很忙〓打杂杂〓普通成员〓1 0 1000 4838 1150〓※★第1届赛宠 水 64000 45150 43093 0〓正常〓0.0000〓137329 137624 137342 137363 137377〓23905〓811382〓0〓112〓295919〓0〓1418〓1677〓3513〓1692〓275〓0〓0〓0〓0〓487423〓5〓5〓1513.1039〓1395 1275 1350 1275 1365 1350 1395 1320〓0〓999〓18773〓100〓917 932 1014 918 917 932 1014 918〓2017-05-23〓76016〓5〓0〓0〓10〓999〓1 1 0〓588〓253 261 267 265 260 265 257 259〓284〓0〓0〓0 0 0 0 0 0 0 0〓0 0 0 0 0 0 0 0〓0〓1〓无〓无〓无〓0〓92〓3004 2794 593 443 3004 2794 593 443〓0 0 0 0 0 0 0 0〓0 0 0 0 0 0 0 0〓未知属性9〓未知属性10〓41〓2015021〓0〓38050〓0〓0〓90〓140 31 50";
        userInfo = UserInfo.parse(s2);
        logLn(userInfo.toString());

    }

    @Test
    public void t1() {
//        签到〓183.60.204.64
//        公告	183.60.204.64	183.60.204.64
//        帮派个人资料〓hy814〓123〓〓〓〓设备验证	183.60.204.64	183.60.204.64
//        帮派个人资料返回〓hy814〓3※有时很忙〓无〓无〓52491 0 91535 20800 20800〓白发妖姬 土 64000 0 136295 0〓正常〓0.0000〓177966 177966 177966 177966 182966〓18510〓2949654〓0〓140〓5709〓3〓2319〓5418〓568〓5234〓5972〓121〓72〓12〓30〓4296162〓0〓0〓1905.0968〓4160 4472 4192 4284 4080 4456 4180 4276〓6000〓0〓1999〓124〓9588 10345 10196 9947 9588 10345 10196 9947〓2017-05-20〓2288869〓16〓27〓999〓0〓999〓1 1 1〓1442〓3136 3156 3137 3117 3007 3004 2992 3038〓2871〓1〓5〓0 0 0 0 0 0 0 0〓60 60 60 60 60 60 60 60〓155484〓0〓无〓无〓无〓0〓112〓4785 4650 4384 1362 4785 4650 4384 1362〓0 0 0 0 0 0 0 0〓120 60 240 180 120 60 240 180〓未知属性9〓未知属性10〓4〓93198〓80〓114962〓42645〓42645〓110〓2521 120 311
//        帮派个人资料返回〓hy814〓3※有时很忙〓无〓无〓52491 0 91535 20800 20800〓白发妖姬 土 64000 0 136295 0〓正常〓0.0000〓177966 177966 177966 177966 182966〓18510〓2950659〓0〓140〓5709〓3〓2319〓5418〓568〓5234〓5972〓121〓72〓12〓30〓4296162〓0〓0〓1905.0968〓4160 4472 4192 4284 4080 4456 4180 4276〓6000〓0〓1999〓124〓9588 10345 10196 9947 9588 10345 10196 9947〓2017-05-20〓2288869〓16〓27〓999〓0〓999〓1 1 1〓1442〓3136 3156 3137 3117 3007 3004 2992 3038〓2861〓1〓5〓0 0 0 0 0 0 0 0〓60 60 60 60 60 60 60 60〓155484〓0〓无〓无〓无〓1〓112〓4785 4650 4384 1362 4785 4650 4384 1362〓0 0 0 0 0 0 0 0〓120 60 240 180 120 60 240 180〓未知属性9〓未知属性10〓4〓93198〓80〓114962〓42645〓42645〓110〓2521 120 311
//        盟军副本十二宫读取地图〓hy814〓123	183.60.204.64	183.60.204.64
//        帮派副本十二宫地图〓323232323200000000000000
//        盟军副本十二宫重置次数〓hy814〓123〓261	183.60.204.64	183.60.204.64
//        帮派副本十二宫重置成功〓003232323200000000000000〓2861〓1
//
//        签到〓183.60.204.64
//        公告	183.60.204.64	183.60.204.64
//        帮派个人资料〓hy814〓123〓〓〓〓设备验证	183.60.204.64	183.60.204.64
//        盟军副本十二宫读取地图〓hy814〓123	183.60.204.64	183.60.204.64
//        帮派副本十二宫地图〓003232323200000000000000
        String s = "盟军个人每日活力任务查询〓33333333333〓30 30 30 49971 2400 495 16140 80 256 111 10〓4";
        String[] split = s.split("〓");
        char[] states = split[1].toCharArray();
        String[] datas = split[2].split(" ");
        logLn(states.length + "");
//        logLn(Arrays.deepToString(states));
        logLn(datas.length + "");
        for (char state : states) {
            if ('3' == state) {
                log("3");
            } else {
                log("其他");
            }

        }
        logLn(Arrays.deepToString(datas));
    }

    private static void logLn(String arg) {
        System.err.println(arg);
    }

    private static void log(String arg) {
        System.err.print(arg);
    }

    /**
     * Convert hex string to byte[]
     *
     * @param hexString the hex string
     * @return byte[]
     */
    public static byte[] hexStringToBytes(String hexString) {
        if (hexString == null || hexString.equals("")) {
            return null;
        }
        hexString = hexString.replace(":", "").toUpperCase();
        int length = hexString.length() / 2;
        char[] hexChars = hexString.toCharArray();
        byte[] d = new byte[length];
        for (int i = 0; i < length; i++) {
            int pos = i * 2;
            d[i] = (byte) (charToByte(hexChars[pos]) << 4 | charToByte(hexChars[pos + 1]));
        }
        return d;
    }

    /**
     * Convert char to byte
     *
     * @param c char
     * @return byte
     */
    private static byte charToByte(char c) {
        return (byte) "0123456789ABCDEF".indexOf(c);
    }


}